#!/bin/bash

SG_ID="sg-00dfeeefdb05693ab"
PORT=80                       # 替换为你要开放的端口（可选如 22, 443, 8080 等）
PROTOCOL="tcp"

IPS=(
  "47.76.255.100/32"
  "35.241.80.74/32"
  "10.170.0.24/32"
  "45.200.114.111/32"
  "45.200.114.112/32"
  "45.200.114.113/32"
  "45.200.112.111/32"
  "45.200.112.112/32"
  "45.200.112.113/32"
  "199.26.99.253/32"
  "205.201.3.253/32"
  "205.201.12.253/32"
  "66.133.94.253/32"
  "208.87.166.253/32"
  "47.128.158.161/32"
  "54.254.238.173/32"
  "160.32.243.224/27"
  "160.32.244.192/27"
  "34.92.99.249/32"
  "54.46.22.213/32"
  "23.155.120.232/32"
  "23.156.8.232/32"
)

for ip in "${IPS[@]}"; do
  echo "Adding rule for $ip"
  #aws ec2 authorize-security-group-ingress \
  #aws ec2 revoke-security-group-ingress \
  aws ec2 authorize-security-group-egress \
    --group-id "$SG_ID" \
    --protocol "$PROTOCOL" \
    --port "$PORT" \
    --cidr "$ip"
done